{
  "courses": [
    {
      "id": 1,
      "title": "Angular 9 Fundamentals",
      "description": "Learn the fundamentals of Angular 9",
      "percentComplete": 26,
      "favorite": true
    },
    {
      "id": 2,
      "title": "Hello",
      "description": "hi",
      "percentComplete": 0,
      "favorite": false
    },
    {
      "id": 3,
      "title": "Haider is Awesome",
      "description": "What hell",
      "percentComplete": 0,
      "favorite": false
    }
  ],
  "recipies": [
    {
      "id": 5,
      "dishName": "Briyaniiiii",
      "ingredients": "basmati rice, marinated meat or chicken, browned onions, cilantro, mint, yogurt, saffron, ghee and spices.",
      "timeNeeded": "30",
      "description": "Fried Onions: Slice onions very finely and fry until crisp and light golden brown.  Onions thinly sliced for frying.   Crispy fried onions for making the recipe. \nChicken Marination: Combine chicken with all marinade ingredients, ⅓ fried onions and ground biryani spice blend.  Chicken, yogurt and ginger garlic paste combined to marinate. \nRice Preparation: Rinse basmati rice until clear. Soak ⅓ cup rice in water. Cook remaining rice in rice cooker.  Preparing rice for lentil cranberry rice recipe. \nAssemble Rice and Chicken Layers: Transfer chicken with marinade to a cooking pot. Top with chopped cilantro, mint, half lemon juice, some olive oil and most of the remaining fried onions.  All the marinade ingredients, spices, herbs, chili peppers placed together for making the rice dish. \nAdd Soaked Rice: Drain and spread it over the chicken.  A thin layer of raw soaked rice sprinkled over the chicken and marinade. \nFinal Rice Layer: Layer all cooked rice. Top with remaining fried onions, lemon juice, saffron water and ghee over the rice.  Layers of rice placed over the chicken marinade. \nSteaming: Cover with parchment paper, followed by aluminum foil and fit the lid tight over it. Bake in oven for one hour, until steam builds up well.  The lid placed over aluminum sheets and sealed tightly to steam the rice and chicken. \nOn Stove top: Alternatively, heat biryani at medium high for 10 to 15 minutes and then simmer at low for one hour until steam builds up well.\nCool biryani for five minutes. Gently mix rice and chicken and serve.",
      "rating": 9,
      "pictureUrl": ""
    },
    {
      "id": 6,
      "dishName": "Chicken Achari",
      "ingredients": "600 gm chicken,\n3 teaspoon garlic paste,\n1/4 teaspoon turmeric,\n1 1/2 teaspoon red chilli powder,\n1 teaspoon mustard seeds,\n1 teaspoon fenugreek seeds,\n1 teaspoon fennel seeds,\n2 tablespoon refined oil,\n50 ml yoghurt (curd),\n1 1/2 onion,\n3 teaspoon ginger paste,\n1/2 teaspoon tomato puree,\n3 red chilli,\n1 teaspoon cumin seeds,\n1 teaspoon nigella seeds,\n1/2 teaspoon lemon juice,\n6 pinches salt\n",
      "timeNeeded": "45",
      "description": "Step 1\nTo make Chicken Achari, Take a pan and heat oil in it. Put fennel seeds, nigella seeds, fenugreek seeds, cumin seeds, mustard seeds and dry red chillies. Fry them for 25 secs.\n\nStep 2\nPut chopped onions in the pan and saute them. Then add ginger and garlic paste and cook while stirring time and again.\n\nStep 3\nPut turmeric and red chilli powder and stir well for a few seconds. Add little water to prevent it from sticking to the surface of the pan.\n\nStep 4\nPut tomato puree and cook it for 2 mins. Now, Cut the chicken into small pieces and add the chicken pieces in the pan. Cook it for about 6-7 mins while stirring from time to time.\n\nStep 5\nOnce done, add about 1/2 cup of water and cover the pan. Cook it for around 20-25 mins on a low flame.\n\nStep 6\nAdd curd and cook for another 4 mins. You can now switch off the flame and add salt and lemon juice to the dish.\n\nStep 7\nPut some chopped coriander leaves on top for garnishing and your Chicken Achari is ready to be served.",
      "rating": 6,
      "pictureUrl": ""
    }
  ]
}